vim-motions.md

# Table of Contents

1.  [Another way to think about is having "motins" and "actions".](#org3e1ccb9)
    1.  [Motions: eg:](#org196de40)
    2.  [Actions: eg:](#org97ac95f)
    3.  [then you can combined them to make more motions:](#orgfaba381)
    4.  [Prepositions](#orge2bd00e)
    5.  [And with prepositions:](#orgc2267fe)
    6.  [inside vs around (i,a)](#orgf8743b1)
    7.  [delete vs edit (d,e)](#orgf328805)
    8.  [there are more motions though, like,](#org8898e1d)


<a id="org3e1ccb9"></a>

# Another way to think about is having "motins" and "actions".


<a id="org196de40"></a>

## Motions: eg:

-   w - move onoe word forward
-   b - move to the beging of the word
-   and h,j,k,l, etc


<a id="org97ac95f"></a>

## Actions: eg:

-   d - delete
-   e - edit


<a id="orgfaba381"></a>

## then you can combined them to make more motions:

-   dw - deletet word
-   db - delete to the begining of word
-   ew - edit word


<a id="orge2bd00e"></a>

## Prepositions

-   i - inside
-   a - around


<a id="orgc2267fe"></a>

## And with prepositions:

-   diw - delete inside word
-   eiw - edti inside word
-   ei( - edit inside parans
-   ei{ - edit insde curly brace
-   eit - edit inside tags
-   the list goes on :)


<a id="orgf8743b1"></a>

## inside vs around (i,a)

-   ei( - edit inside parans -> delete the content inside the parans and put you to insert mode
-   ea( - edit arond parans -> delete the content and the parans and then put you to insert mode


<a id="orgf328805"></a>

## delete vs edit (d,e)

-   di( - Delete inside parans -> delete the content inside parans but keeps you in nomral mode
-   ei( - Edit inside parans -> delete the content inside parans and puts you to insert mode


<a id="org8898e1d"></a>

## there are more motions though, like,

-   f - find char
-   F - find char backwords
-   (then , ; to go back and forth them)
-   0 - go to the beining of line
-   $ - go to the end of line
